### Objective

get top 14 players from each country in world cup

go from there ...?

In [1]:
import pandas as pd
import numpy as np

In [2]:
# player_data = pd.read_csv('basicplayerdata.csv')
player_data = pd.read_csv('work.csv')

In [3]:
player_data.head()

,Unnamed: 0,ID,Name,Photo,Nationality,Flag,Overall,Potential,Club,Club Logo,Value,Wage,Special
0,0,226789,A. Fulgini,https://cdn.sofifa.net/players/226/789/22_60.png,NaN,France,78,82,Angers SCO,https://cdn.sofifa.net/teams/1530/30.png,€20M,€23K,2060
1,1,251470,C. De Ketelaere,https://cdn.sofifa.net/players/251/470/22_60.png,NaN,Belgium,77,87,Club Brugge KV,https://cdn.sofifa.net/teams/231/30.png,€23.5M,€22K,2055
2,2,233531,Y. Soteldo,https://cdn.sofifa.net/players/233/531/22_60.png,NaN,Venezuela,76,80,Tigres U.A.N.L.,https://cdn.sofifa.net/teams/1970/30.png,€11M,€37K,1850
3,3,220440,C. Lenglet,https://cdn.sofifa.net/players/220/440/22_60.png,NaN,France,80,83,FC Barcelona,https://cdn.sofifa.net/teams/241/30.png,€24.5M,€125K,1875
4,4,189461,J. Wilshere,https://cdn.sofifa.net/players/189/461/22_60.png,NaN,England,73,73,Aarhus GF,https://cdn.sofifa.net/teams/271/30.png,€3M,€14K,2013

In [4]:
player_data.drop(['Nationality'], axis=1, inplace=True)

In [5]:
df = player_data.rename(columns={'Flag': 'Nationality'})

In [6]:
df.head()

,Unnamed: 0,ID,Name,Photo,Nationality,Overall,Potential,Club,Club Logo,Value,Wage,Special
0,0,226789,A. Fulgini,https://cdn.sofifa.net/players/226/789/22_60.png,France,78,82,Angers SCO,https://cdn.sofifa.net/teams/1530/30.png,€20M,€23K,2060
1,1,251470,C. De Ketelaere,https://cdn.sofifa.net/players/251/470/22_60.png,Belgium,77,87,Club Brugge KV,https://cdn.sofifa.net/teams/231/30.png,€23.5M,€22K,2055
2,2,233531,Y. Soteldo,https://cdn.sofifa.net/players/233/531/22_60.png,Venezuela,76,80,Tigres U.A.N.L.,https://cdn.sofifa.net/teams/1970/30.png,€11M,€37K,1850
3,3,220440,C. Lenglet,https://cdn.sofifa.net/players/220/440/22_60.png,France,80,83,FC Barcelona,https://cdn.sofifa.net/teams/241/30.png,€24.5M,€125K,1875
4,4,189461,J. Wilshere,https://cdn.sofifa.net/players/189/461/22_60.png,England,73,73,Aarhus GF,https://cdn.sofifa.net/teams/271/30.png,€3M,€14K,2013

In [7]:
df.shape

(13500, 12)

In [8]:
13500*11

148500

In [9]:
print(df['Nationality'].value_counts())

England                1112
Germany                 729
Spain                   723
Argentina               644
France                  635
                       ...
Grenada                   1
Saint Lucia               1
Chad                      1
Bahrain                   1
Antigua and Barbuda       1
Name: Nationality, Length: 147, dtype: int64

In [10]:
df = df.drop(['Photo', 'Club Logo', 'Club', 'ID', 'Wage'], axis=1)

## Separate df by nationality

In [11]:
england = df[df["Nationality"] == "England"]

In [12]:
germany = df[df["Nationality"] == "Germany"]

In [13]:
spain = df[df["Nationality"] == "Spain"]

In [14]:
france = df[df["Nationality"] == "France"]

In [15]:
argentina = df[df["Nationality"] == "Argentina"]

In [16]:
brazil = df[df["Nationality"] == "Brazil"]

In [17]:
swiss = df[df["Nationality"] == "Switzerland"]

In [18]:
usa = df[df["Nationality"] == "USA"]

In [19]:
netherlands = df[df["Nationality"] == "Netherlands"]

In [20]:
senegal = df[df["Nationality"] == "Senegal"]

In [21]:
ecuador = df[df["Nationality"] == "Ecuador"]

In [22]:
wales = df[df["Nationality"] == "Wales"]

In [23]:
iran = df[df["Nationality"] == "Iran"]

In [24]:
poland = df[df["Nationality"] == "Poland"]

In [25]:
mexico = df[df["Nationality"] == "Mexico"]

In [26]:
saudi_arabia = df[df["Nationality"] == "Saudi Arabia"]

In [27]:
denmark = df[df["Nationality"] == "Denmark"]

In [28]:
tunisia = df[df["Nationality"] == "Tunisia"]

In [29]:
australia = df[df["Nationality"] == "Australia"]

In [30]:
japan = df[df["Nationality"] == "Japan"]

In [31]:
costa_rica = df[df["Nationality"] == "Costa Rica"]

In [32]:
belgium = df[df["Nationality"] == "Belgium"]

In [33]:
croatia = df[df["Nationality"] == "Croatia"]

In [34]:
canada = df[df["Nationality"] == "Canada"]

In [35]:
morocco = df[df["Nationality"] == "Morocco"]

In [36]:
serbia = df[df["Nationality"] == "Serbia"]

In [37]:
cameroon = df[df["Nationality"] == "Cameroon"]

In [38]:
portugal = df[df["Nationality"] == "Portugal"]

In [39]:
uruguay = df[df["Nationality"] == "Uruguay"]

In [40]:
ghana = df[df["Nationality"] == "Ghana"]

In [41]:
korea_republic = df[df["Nationality"] == "Korea Republic"]

In [42]:
qatar = df[df["Nationality"] == "Qatar"]

## Separate into top 14 players overall by nationality

In [43]:
portugal = portugal.sort_values(by=['Overall'], ascending=False)
portugal = portugal.iloc[:14]

In [44]:
uruguay = uruguay.sort_values(by=['Overall'], ascending=False)
uruguay = uruguay.iloc[:14]

In [45]:
ghana = ghana.sort_values(by=['Overall'], ascending=False)
ghana = ghana.iloc[:14]

In [46]:
korea_republic = korea_republic.sort_values(by=['Overall'], ascending=False)
korea_republic = korea_republic.iloc[:14]

In [47]:
qatar = qatar.sort_values(by=['Overall'], ascending=False)
qatar = qatar.iloc[:14]

In [48]:
japan = japan.sort_values(by=['Overall'], ascending=False)
japan = japan.iloc[:14]

In [49]:
costa_rica = costa_rica.sort_values(by=['Overall'], ascending=False)
costa_rica = costa_rica.iloc[:14]

In [50]:
belgium = belgium.sort_values(by=['Overall'], ascending=False)
belgium = belgium.iloc[:14]

In [51]:
croatia = croatia.sort_values(by=['Overall'], ascending=False)
croatia = croatia.iloc[:14]

In [52]:
canada = canada.sort_values(by=['Overall'], ascending=False)
canada = canada.iloc[:14]

In [53]:
morocco = morocco.sort_values(by=['Overall'], ascending=False)
morocco = morocco.iloc[:14]

In [54]:
cameroon = cameroon.sort_values(by=['Overall'], ascending=False)
cameroon = cameroon.iloc[:14]

In [55]:
england = england.sort_values(by=['Overall'], ascending=False)
england = england.iloc[:14]

In [56]:
serbia = serbia.sort_values(by=['Overall'], ascending=False)
serbia = serbia.iloc[:14]

In [57]:
germany = germany.sort_values(by=['Overall'], ascending=False)
germany = germany.iloc[:14]

In [58]:
spain = spain.sort_values(by=['Overall'], ascending=False)
spain = spain.iloc[:14]

In [59]:
france = france.sort_values(by=['Overall'], ascending=False)
france = france.iloc[:14]

In [60]:
argentina = argentina.sort_values(by=['Overall'], ascending=False)
argentina = argentina.iloc[:14]

In [61]:
brazil = brazil.sort_values(by=['Overall'], ascending=False)
brazil = brazil.iloc[:14]

In [62]:
swiss = swiss.sort_values(by=['Overall'], ascending=False)
swiss = swiss.iloc[:14]

In [63]:
usa = usa.sort_values(by=['Overall'], ascending=False)
usa = usa.iloc[:14]

In [64]:
netherlands = netherlands.sort_values(by=['Overall'], ascending=False)
netherlands = netherlands.iloc[:14]

In [65]:
senegal = senegal.sort_values(by=['Overall'], ascending=False)
senegal = senegal.iloc[:14]

In [66]:
ecuador = ecuador.sort_values(by=['Overall'], ascending=False)
ecuador = ecuador.iloc[:14]

In [67]:
wales = wales.sort_values(by=['Overall'], ascending=False)
wales = wales.iloc[:14]

In [68]:
iran = iran.sort_values(by=['Overall'], ascending=False)
iran = iran.iloc[:14]

In [69]:
poland = poland.sort_values(by=['Overall'], ascending=False)
poland = poland.iloc[:14]

In [70]:
mexico = mexico.sort_values(by=['Overall'], ascending=False)
mexico = mexico.iloc[:14]

In [71]:
saudi_arabia = saudi_arabia.sort_values(by=['Overall'], ascending=False)
saudi_arabia = saudi_arabia.iloc[:14]

In [72]:
denmark = denmark.sort_values(by=['Overall'], ascending=False)
denmark = denmark.iloc[:14]

In [73]:
tunisia = tunisia.sort_values(by=['Overall'], ascending=False)
tunisia = tunisia.iloc[:14]

In [74]:
australia = australia.sort_values(by=['Overall'], ascending=False)
australia = australia.iloc[:14]

In [75]:
saudi_arabia

,Unnamed: 0,Name,Nationality,Overall,Potential,Value,Special
3923,3923,M. Al Buraik,Saudi Arabia,71,71,€1.7M,1909
3332,3332,A. Ghareeb,Saudi Arabia,68,70,€1.6M,1639
3320,3320,N. Al Dawsari,Saudi Arabia,67,76,€2.2M,1819
3794,3794,A. Al Ammar,Saudi Arabia,67,67,€975K,1753
1865,1865,N. Al Dawsari,Saudi Arabia,67,76,€2.2M,1819
12918,12918,K. Al Ghannam,Saudi Arabia,64,78,€1.4M,1519
4095,4095,N. Al Subhi,Saudi Arabia,64,64,€400K,1625
4084,4084,A. Al Fahad,Saudi Arabia,64,66,€625K,1690
9957,9957,M. Al Harbi,Saudi Arabia,63,72,€1M,1664
10767,10767,N. Boushal,Saudi Arabia,63,74,€1M,1614
3339,3339,A. Adam,Saudi Arabia,63,63,€525K,1510
12249,12249,K. Al Khathlan,Saudi Arabia,63,65,€550K,1520
3458,3458,M. Harzan,Saudi Arabia,62,62,€325K,1578
4045,4045,21 A. Al Nazera,Saudi Arabia,62,62,€425K,1601

In [76]:
teams = [netherlands, senegal, ecuador, england, usa, wales, iran, 
         argentina, poland, mexico, saudi_arabia, france, denmark, tunisia, 
         australia, germany, spain, japan, costa_rica, belgium, croatia, 
         canada, morocco, brazil, swiss, serbia, cameroon, portugal, 
         uruguay, ghana, korea_republic, qatar]

In [77]:
wc_teams = pd.concat(teams)

In [78]:
wc_teams

,Unnamed: 0,Name,Nationality,Overall,Potential,Value,Special
862,862,V. van Dijk,Netherlands,90,90,€100M,2118
73,73,F. de Jong,Netherlands,87,92,€119.5M,2234
47,47,M. de Ligt,Netherlands,85,89,€71M,1984
2302,2302,S. de Vrij,Netherlands,84,84,€35.5M,1853
2423,2423,18 W. Sneijder,Netherlands,83,83,€15.5M,1964
...,...,...,...,...,...,...,...
1810,1810,Um Won Sang,Korea Republic,70,78,€3.6M,1746
10713,10713,Won Du Jae,Korea Republic,70,74,€2.1M,1682
1014,1014,Song Min Kyu,Korea Republic,70,81,€3.6M,1760
4640,4640,Lee Chung Yong,Korea Republic,70,70,€1.3M,1828
3205,3205,Lee Dong Kyung,Korea Republic,70,75,€2.4M,1904

In [79]:
32*23
# 32 teams x 23 players
# 736 total players

736

In [80]:
teams2022 = wc_teams['Nationality']

In [81]:
teams2022.value_counts()

Netherlands       14
Senegal           14
Ghana             14
Uruguay           14
Portugal          14
Cameroon          14
Serbia            14
Switzerland       14
Brazil            14
Morocco           14
Canada            14
Croatia           14
Belgium           14
Japan             14
Spain             14
Germany           14
Australia         14
Tunisia           14
Denmark           14
France            14
Saudi Arabia      14
Mexico            14
Poland            14
Argentina         14
Wales             14
England           14
Ecuador           14
Korea Republic    14
Costa Rica        10
Iran               6
Name: Nationality, dtype: int64

Teams:
* Group A:
    - Qatar
    - Netherlands
    - Senegal
    - Ecuador
    
* Group B:
    - England
    - USA
    - Wales
    - Iran
    
* Group C:
    - Argentina
    - Poland
    - Mexico
    - Saudi Arabia
    
* Group D:
    - France
    - Denmark
    - Tunisia
    - Australia
    
* Group E:
    - Germany
    - Spain
    - Canada
    - Morocco
    
* Group F:
    - Belgium
    - Croatia
    - Canada
    - Morocoo
    
* Group G
    - Brazil
    - Switzerland
    - Serbia
    - Cameroon
    
* Group H:
    - Portugal
    - Uruguay
    - Ghana
    - Korea Republic

In [84]:
wc_teams

,Unnamed: 0,Name,Nationality,Overall,Potential,Value,Special
862,862,V. van Dijk,Netherlands,90,90,€100M,2118
73,73,F. de Jong,Netherlands,87,92,€119.5M,2234
47,47,M. de Ligt,Netherlands,85,89,€71M,1984
2302,2302,S. de Vrij,Netherlands,84,84,€35.5M,1853
2423,2423,18 W. Sneijder,Netherlands,83,83,€15.5M,1964
...,...,...,...,...,...,...,...
1810,1810,Um Won Sang,Korea Republic,70,78,€3.6M,1746
10713,10713,Won Du Jae,Korea Republic,70,74,€2.1M,1682
1014,1014,Song Min Kyu,Korea Republic,70,81,€3.6M,1760
4640,4640,Lee Chung Yong,Korea Republic,70,70,€1.3M,1828
3205,3205,Lee Dong Kyung,Korea Republic,70,75,€2.4M,1904